Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: Therefore, the easiest way to tune the StallGuard2 threshold SGT for a specific motor type and operating conditions is interactive tuning in the actual application.
it_it: Pertanto, il modo più semplice per regolare la soglia di StallGuard2 SGT per un tipo di motore e condizioni operative specifici è la regolazione interattiva nell'applicazione effettiva.

source: Therefore, the maximum load needs to be determined, which the motor can drive without stalling.
it_it: Pertanto, è necessario determinare il carico massimo che il motore può gestire senza stallo.

source: Therefore, we do not have any direct feedback information about the motor position and its operating current at any instant.
it_it: Pertanto, non abbiamo alcuna informazione di feedback diretta sulla posizione del motore e sulla sua corrente di funzionamento in nessun istante.

source: Therefore, we recommend the automatic mode, unless current regulation is not satisfying in the given operating conditions.
it_it: Pertanto, consigliamo la modalità automatica, a meno che la regolazione della corrente non sia soddisfacente nelle condizioni operative specificate.

source: These are NO LOAD when there is no mechanical load at the axis while the stepper motor is freely running; HALF LOAD when the load is between NO LOAD and the maximum load; MAXIMUM LOAD when the rotor is close to stall .
it_it: Questi sono NO LOAD [nessun carico] quando non c'è carico meccanico sull'asse mentre il motore passo-passo è in rotazione libera; HALF LOAD [metà carico] quando il carico è compreso tra NO LOAD e il carico massimo; MAXIMUM LOAD [carico massimo] quando il rotore è prossimo allo stallo .

source: These factors can be compensated for by proper settings and proper usage conditions of StallGuard2 in a certain velocity range.
it_it: Questi fattori possono essere compensati da impostazioni e condizioni d'uso appropriate di StallGuard2 in un determinato intervallo di velocità.

source: These features contribute toward greater precision, greater energy efficiency, higher reliability, smoother motion, and cooler operation in many stepper motor applications.
it_it: Queste funzionalità contribuiscono a una maggiore precisione, una maggiore efficienza energetica, una maggiore affidabilità, un movimento più fluido e un funzionamento più "fresco" in molte applicazioni con motori passo-passo.

source: These parameter sets can be configured at runtime in the Trinamic driver ICs.
it_it: Questi set di parametri possono essere configurati in fase di esecuzione nei circuiti integrati del driver Trinamic.

source: These parameters can be set using information in the Product Reference Guide supplied with your decoder.
it_it: Questi parametri possono essere impostati utilizzando le informazioni contenute nella Guida di Riferimento del Prodotto fornita con il decoder.

source: These registers contain
it_it: Questi registri contengono

source: These velocities are typically characterized by the motor back EMF reaching the supply voltage.
it_it: Queste velocità sono tipicamente caratterizzate dal fatto che la forza controelettromotrice del motore raggiunge la tensione di alimentazione.

source: They are evaluated using tristate detection, in order to differentiate between
it_it: Vengono valutati utilizzando il rilevamento tristate, al fine di distinguere tra

source: They can be tuned separately because they are triggered by different events that may need different responses.
it_it: Possono essere sintonizzati separatamente perché vengono attivati ​​da eventi diversi che potrebbero richiedere risposte diverse.

source: They should show a difference of at least 100 or a few 100, which shall be large compared to the offset.
it_it: Dovrebbero mostrare una differenza di almeno 100 o di qualche centinaio, che deve essere ampia rispetto all'offset.

source: This algorithm is especially useful for tuning SGT within the application to give the best result independent of environment conditions, motor stray, etc.
it_it: Questo algoritmo è particolarmente utile per ottimizzare SGT all'interno dell'applicazione, in modo da ottenere il miglior risultato indipendentemente dalle condizioni ambientali, dalla dispersione del motore, ecc.

source: This allows direct 32-bit data word communication with the register set.
it_it: Ciò consente la comunicazione diretta di parole di dati a 32 bit con il set di registri.

source: This allows putting the motor into freewheeling.
it_it: Ciò consente di mettere il motore in modalità ruota libera [folle].

source: This also is the most energy-efficient point of operation for the motor.
it_it: Questo è anche il punto di funzionamento più efficiente dal punto di vista energetico per il motore.

source: This application note describes how to set up StallGuard by determination of a single parameter: the StallGuard threshold value.
it_it: Questa nota applicativa descrive come impostare StallGuard determinando un singolo parametro: il valore di soglia di StallGuard.

source: This application note is a practical guide for parameterization of the TRINAMIC ICs with StallGuard2, StallGuard4, and CoolStep as well as for evaluation boards and module products using these ICs.
it_it: Questa nota applicativa è una guida pratica per la parametrizzazione dei circuiti integrati TRINAMIC con StallGuard2, StallGuard4 e CoolStep, nonché per schede di valutazione e moduli che utilizzano questi circuiti integrati.

source: This application note proposes a solution with two stepper motors of the same type with both motors mechanically coupled.
it_it: Questa nota applicativa propone una soluzione con due motori passo-passo dello stesso tipo, entrambi accoppiati meccanicamente.

source: This application note shows how to find the usable range and the required settings.
it_it: Questa nota applicativa mostra come trovare l'intervallo utilizzabile e le impostazioni necessarie.

source: This back EMS indicates the mechanical load on the motor meaning it can be used to monitor the actual load conditions of a drive system without using additional components.
it_it: Questo back EMS indica il carico meccanico sul motore, il che significa che può essere utilizzato per monitorare le condizioni di carico effettive di un sistema di azionamento senza utilizzare componenti aggiuntivi.

source: This bit is 0 for read access and 1 for write access.
it_it: Questo bit è 0 per l'accesso in lettura e 1 per l'accesso in scrittura.

source: This can be archived by
it_it: Questo può essere ottenuto

source: This can be corrected as a linear reduction of SG_RESULT at increasing temperature, as motor efficiency is reduced.
it_it: Questo può essere corretto come una riduzione lineare di SG_RESULT all'aumentare della temperatura, poiché l'efficienza del motore diminuisce.

source: This can be done in full steps, half steps or smaller micro steps using additional current states.
it_it: Questo può essere fatto a passi interi, mezzi passi o micro passi più piccoli utilizzando stati di corrente aggiuntivi.

source: This can be used for daisy chaining multiple chips.
it_it: Questo può essere utilizzato per il collegamento a cascata di più chip.

source: This causes a phase shift between the magnetic field of the rotor and the direction of the rotating field of the stepper.
it_it: Questo provoca uno sfasamento tra il campo magnetico del rotore e la direzione del campo rotante del motore passo-passo.

source: This chapter describes each available SSI command, including field descriptions and host and decoder requirements.
it_it: In questo capitolo vengono descritti tutti i comandi SSI disponibili, comprese le descrizioni dei campi e i requisiti dell'host e del decoder.

source: This chapter describes the system requirements of the Simple Serial Interface (SSI), which provides a communications link between Zebra Technologies decoders and a serial host.
it_it: Questo capitolo descrive i requisiti di sistema della Simple Serial Interface (SSI), che fornisce un link di comunicazione tra i decoder Zebra Technologies e un host seriale.

source: This chapter gives an overview of the complete register set.
it_it: Questo capitolo fornisce una panoramica dell'intero set di registri.

source: This corresponds to a load angle of 90° between the magnetic field of the coils and magnets in the rotor.
it_it: Ciò corrisponde a un angolo di carico di 90° tra il campo magnetico delle bobine e i magneti nel rotore.

source: This current generates an electromagnetic field which forces the magnetic rotor into the desired position.
it_it: Questa corrente genera un campo elettromagnetico che forza il rotore magnetico nella posizione desiderata.

source: This defines how low the current will be regulated in case of a cool step.
it_it: Definisce quanto bassa verrà regolata la corrente in caso di fase di "cool step" [raffreddamento].

source: This gives more information on the drive allowing functions like sensorless homing and diagnostics of the drive mechanics.
it_it: Ciò fornisce maggiori informazioni sull'azionamento, consentendo funzioni come l'homing senza sensori e la diagnostica della meccanica dell'azionamento.

source: This graph was taken at a constant CS value of 16.
it_it: Questo grafico è stato preso con un valore di CS costante di 16.

source: This guide is meant as a practical tool to come to a first configuration and do a minimum set of measurements and decisions for tuning the driver.
it_it: Questa guida vuole essere uno strumento pratico per arrivare ad una prima configurazione ed effettuare un insieme minimo di misurazioni e decisioni per la messa a punto del driver.

source: This is OK since the effective torque outputs depends on the current in the motor coils.
it_it: Questo è corretto poiché la coppia effettiva in uscita dipende dalla corrente nelle bobine del motore.

source: This is a positive acknowledgment of a received packet and can be used in place of the CMD_ACK command to allow users to control the beeper, pager motor (i.e., vibration feedback) and LEDs after receiving decoded data or any other SSI command.
it_it: Si tratta di una conferma positiva di un pacchetto ricevuto e può essere utilizzato al posto del comando CMD_ACK per consentire agli utenti di controllare il segnalatore acustico, il motore del cercapersone (ovvero il feedback tramite vibrazione) e i LED dopo aver ricevuto dati decodificati o qualsiasi altro comando SSI.

source: This is also true for the motor run current.
it_it: Questo vale anche per la corrente di funzionamento del motore.

source: This is because StallGuard is based on the back-EMF the motor is producing.
it_it: Questo perché StallGuard si basa sulla forza controelettromotrice (back-EMF) prodotta dal motore.

source: This is because during the acceleration phase the back EMF is changing quickly and this could cause a preemptive StallGuard event to occur.
it_it: Questo perché durante la fase di accelerazione la forza controelettromotrice (back EMF) cambia rapidamente e questo potrebbe causare un evento StallGuard preventivo.

source: This is due to the limitations of the update rate of the display.
it_it: Ciò è dovuto ai limiti della frequenza di aggiornamento del display.

source: This is enough to safely detect a stall because a stall always means the loss of four full steps.
it_it: Questo è sufficiente per rilevare in modo sicuro uno stallo, poiché uno stallo comporta sempre la perdita di quattro passi completi.

source: This is equivalent to a load angle of 90°.
it_it: Ciò equivale a un angolo di carico di 90°.

source: This is perfect when motor type and supply voltage are well known.
it_it: Questa modalità è perfetta quando il tipo di motore e la tensione di alimentazione sono ben noti.

source: This is possible by programming the pin ENCA_DCIN to act as a step disable function.
it_it: Ciò è possibile programmando il pin ENCA_DCIN in modo che agisca come funzione di disabilitazione del passo.

source: This is repeated multiple times in figure 4.2.
it_it: Questo viene ripetuto più volte nella figura 4.2.

source: This is the StallGuard2 result.
it_it: Questo è il risultato di StallGuard2.

source: This may be faster than Option 1 because the host receives data on a periodic basis without attempting to send the ACK/NAK, but slower than Option 2 since the inter-packet delay transpires on each packet.
it_it: Questa potrebbe essere più veloce dell'Opzione 1 perché l'host riceve i dati periodicamente senza tentare di inviare l'ACK/NAK, ma più lenta dell'Opzione 2 poiché il ritardo inter-pacchetto si verifica su ogni pacchetto.

source: This means, that efficiency at low velocities is also low.
it_it: Ciò significa che anche l'efficienza a basse velocità è bassa.

source: This message halts (and discards) an unwanted transmission by the decoder.
it_it: Questo messaggio interrompe (e scarta) una trasmissione indesiderata da parte del decoder.

source: This offset will vary with motor temperature because the coil resistance increases with the coil temperature.
it_it: Questo offset varia con la temperatura del motore, poiché la resistenza della bobina aumenta con la temperatura della bobina.

source: This parameter defines the speed of decreasing the current.
it_it: Questo parametro definisce la velocità di riduzione della corrente.

source: This parameter defines the speed of increasing the current when a load is detected.
it_it: Questo parametro definisce la velocità di aumento della corrente quando viene rilevato un carico.

source: This parameter defines the upper threshold for the StallGuard value SG.
it_it: Questo parametro definisce la soglia superiore per il valore SG di StallGuard.

source: This parameter enables and disables parameter bar code scanning.
it_it: Questo parametro abilita e disabilita la scansione dei codici a barre dei parametri.

source: This parameter selects the scale of current reduction.
it_it: Questo parametro seleziona la scala di riduzione della corrente.

source: This phase shift is load angle or the angle between the two magnetic field directions of the motor's rotor and the stepper.
it_it: Questo sfasamento è l'angolo di carico, ovvero l'angolo tra le due direzioni del campo magnetico del rotore del motore e del motore passo-passo.

source: This phase shift is the load angel.
it_it: Questo sfasamento è l'angolo di carico.

source: This pseudo code assumes that the receiving is enabled.
it_it: Questo Pseudocodice Presuppone che la Ricezione sia Abilitata.

source: This register set offers registers for
it_it: Questo set di registri offre registri per

source: This represents the lower load limit, because the StallGuard2 value SG represents the reserve of load angle to stall condition.
it_it: Questo rappresenta il limite inferiore di carico, poiché il valore SG di StallGuard2 rappresenta la riserva di angolo di carico per la condizione di stallo.

source: This saves energy and keeps the components cool.
it_it: Ciò consente di risparmiare energia e di mantenere i componenti "freschi".

source: This sensorless load dependent current control always drives the motor at the minimum amount required for the actual load condition.
it_it: Questo controllo di corrente sensorless, dipendente dal carico, aziona sempre il motore al minimo richiesto per le condizioni di carico effettive.

source: This should be set to a velocity relatively close to the actual velocity.
it_it: Questo valore dovrebbe essere impostato su una velocità relativamente vicina a quella effettiva.

source: This signed value controls the StallGuard2 threshold level for stall detection and sets the optimum measurement range for readout.
it_it: Questo valore con segno controlla il livello di soglia di StallGuard2 per il rilevamento dello stallo e imposta l'intervallo di misura ottimale per la lettura.

source: This spare energy is a measure for the mechanical load applied to the motor.
it_it: Questa energia di riserva è una misura del carico meccanico applicato al motore.

source: This status value provides the actual motor current scale as controlled by CoolStep.
it_it: Questo valore di stato fornisce la corrente effettiva del motore scale controllata da CoolStep.

source: This threshold is an offset that is added to the stall guard value itself.
it_it: Questa soglia è un offset che viene aggiunto al valore di stall guard stesso.

source: This transaction is more complicated than the host transmission.
it_it: Questa transazione è più complessa della trasmissione all'host.

source: This value controls the StallGuard4 threshold for stall detection.
it_it: Questo valore controlla la soglia di StallGuard4 per il rilevamento dello stallo.

source: This velocity value should not be too low or too high as too small value of velocity will have a very low back EMF energy which will be difficult to be detected.
it_it: Questo valore di velocità non deve essere né troppo basso né troppo alto, poiché un valore di velocità troppo basso avrà un'energia di controelettromotrice molto bassa, difficile da rilevare.

source: This way you can adapt SGTHRS starting from an initial value where StallGuard4 reacts too sensitively, until a stall is not safely detected anymore.
it_it: In questo modo è possibile adattare SGTHRS partendo da un valore iniziale in cui StallGuard4 reagisce in modo troppo sensibile, fino a quando uno stallo non viene più rilevato in modo sicuro.

source: This way, SGT can be set to an optimum at near zero velocity.
it_it: In questo modo, SGT può essere impostato in modo ottimale a velocità prossima allo zero.

source: This way, the stepper motor never stalls and can drive heavy loads as fast as possible.
it_it: In questo modo, il motore passo-passo non si ferma mai e può trasportare carichi pesanti il ​​più velocemente possibile.

source: This way, you can increase SGT (or decrease the SG threshold which your software uses to detect a stall) starting from an initial value where StallGuard2 acts too sensitively, until a stall is not safely detected anymore.
it_it: In questo modo, è possibile aumentare l'SGT (o diminuire la soglia di SG utilizzata dal software per rilevare uno stallo) partendo da un valore iniziale in cui StallGuard2 agisce in modo troppo sensibile, fino a quando uno stallo non viene più rilevato in modo sicuro.

source: This way, you find the possible stray and get a feeling for the required safety margin to compensate for production stray.
it_it: In questo modo, si individua la possibile deriva e si ottiene un'idea del margine di sicurezza necessario per compensare la deriva di produzione.

source: Thus, StealthChop operated stepper motor applications are very suitable for indoor or home use.
it_it: Pertanto, le applicazioni per motori passo-passo con StealthChop sono ideali per l'uso in interni o in casa.

source: To apply load from zero up to stall or close to stall one needs to run both steppers with a difference with up to one full step.
it_it: Per applicare il carico da zero fino allo stallo o vicino allo stallo, è necessario far funzionare entrambi i motori passo-passo con una differenza fino a un passo completo.

source: To avoid this one can either use a multi-axis controller clocked with a single clock or clock for two different stepper motor controllers with a single clock.
it_it: Per evitare ciò, è possibile utilizzare un controller multiasse con un singolo clock o un clock per due diversi controller per motori passo-passo con un singolo clock.

source: To determine a reset of the driver, DIAG0 always shows a power-on reset condition by pulling low during a reset condition.
it_it: Per determinare un ripristino del driver, DIAG0 mostra sempre una condizione di ripristino all'accensione abbassando il livello durante una condizione di ripristino.

source: To get this working, we set the smart energy threshold speed to a value less than the current motor velocity of 53687.
it_it: Per far funzionare questo sistema, impostiamo la soglia di velocità dell'energia intelligente a un valore inferiore alla velocità attuale del motore, pari a 53687.

source: To safely detect a motor stall the stall threshold must be determined using a specific SGT setting.
it_it: Per rilevare in modo sicuro uno stallo del motore, la soglia di stallo deve essere determinata utilizzando un'impostazione specifica di SGT.

source: To safely determine a reset condition, monitor the reset flag by SPI or read out any register to confirm that the chip is powered up.
it_it: Per determinare in modo sicuro una condizione di reset, monitorare il flag reset tramite SPI o leggere qualsiasi registro per confermare che il chip è alimentato.

source: To set up StallGuard2, one single parameter named SGT ( StallGuard T hreshold) needs to be chosen.
it_it: Per impostare StallGuard2, è necessario scegliere un singolo parametro denominato SGT ( StallGuard T hreshold) [soglia di soglia di StallGuard].

source: To set up the DIAG pin to operate as a StallGuard output go through the specific IC’s datasheet and read the diagnostics section.
it_it: Per configurare il pin DIAG in modo che funzioni come uscita StallGuard, consultare la scheda tecnica del circuito integrato specifico e leggere la sezione dedicata alla diagnostica.

source: To start parameterization, first choose a SEMIN in the range of SG_MAX / 4 … SG_MAX / 8.
it_it: Per avviare la parametrizzazione, scegliere innanzitutto un SEMIN compreso tra SG_MAX / 4 e SG_MAX / 8.

source: To summarize: there are different StallGuard2 values for different speeds / operating points.
it_it: Riassumendo: esistono diversi valori di StallGuard2 per diverse velocità/punti operativi.

source: To use StallGuard2 and CoolStep, the StallGuard2 sensitivity should first be tuned using the SGT setting!
it_it: Per utilizzare StallGuard2 e CoolStep, è necessario prima regolare la sensibilità di StallGuard2 utilizzando l'impostazione SGT!

source: Today we are going to discuss how to configure the STOCK.2 and CoolStep for a stepper motor using TMC5130 evalKit and TMCM integrated development environment.
it_it: Oggi parleremo di come configurare StallGuard2 e CoolStep per un motore passo-passo utilizzando il kit di valutazione TMC5130 e l'ambiente di sviluppo integrato TMCM.

source: Topics covered in this guide are as follows:
it_it: Gli argomenti trattati in questa guida sono i seguenti:

source: Transfer of Decode Data
it_it: Trasferimento dei Dati di Decodifica

source: Transmits stored decode data.
it_it: Trasmette i dati di decodifica memorizzati.

source: Try first with a speed in the range of some rps (revolutions per second).
it_it: Provare prima con una velocità nell'intervallo di alcuni giri al secondo (rps) [revolutions per second].

source: Try first with speed in the range of a few RPS (revolutions per second).
it_it: Provare prima con una velocità nell'intervallo di pochi RPS (giri al secondo).

source: Tune the SGT setting to show a SG_RESULT reading of roughly 0 to 100 at maximum load before motor stall.
it_it: Regolare l'impostazione SGT per visualizzare una lettura di SG_RESULT compresa tra 0 e 100 circa al carico massimo prima dello stallo del motore.

source: Tune the configuration parameters for your motor and application for optimum performance.
it_it: Regolare i parametri di configurazione per il motore e la propria applicazione per prestazioni ottimali.

source: Turning the rotor is forced by the rotating magnetic field of the stator.
it_it: La rotazione del rotore è forzata dal campo magnetico rotante dello statore.

source: Two additional chopper modes are available: a traditional constant off-time mode and the SpreadCycle mode.
it_it: Sono disponibili due modalità chopper aggiuntive: una tradizionale modalità a tempo di fermo costante e la modalità SpreadCycle.
